const EquipType = {
  武器: '武器',
  副手: '副手',
  头盔: '头盔',
  胸甲: '胸甲',
  护腿: '护腿',
  鞋子: '鞋子',
  项链: '项链',
  戒指: '戒指',
};

const equipConfigs = {
  // 下水道
  老鼠皮甲: {
    requirements: { level: 3, expertiseLevel: 0 },
    type: EquipType.胸甲,
    name: '老鼠皮甲',
    description: '用老鼠皮做成的胸甲。',
    stats: {
      最大生命值: 30,
      最大魔法值: 0,
      生命回复: 1,
      魔法回复: 0,
      生命回复效率: 0,
      魔法回复效率: 0,
      攻击力: 0,
      防御力: 2,
      攻击间隔: 0,
      攻击速度: 0,
      暴击率: 0,
      暴击伤害: 0,
      闪避率: 0,
      格挡率: 10,
      格挡伤害: 5,
      伤害抗性: {
        物理: 5,
      },
      抗性穿透: {},
      生命偷取: 0,
      技能急速: 0,
      幸运值: 0,
      最大魔典数: 0,
    },
  },
  // 新大陆
  新手木剑: {
    requirements: { level: 2, expertiseLevel: 0 },
    type: EquipType.武器,
    name: '新手木剑',
    description: '一把普通的木剑。',
    stats: {
      最大生命值: 20,
      最大魔法值: 0,
      生命回复: 0,
      魔法回复: 0,
      生命回复效率: 0,
      魔法回复效率: 0,
      攻击力: 5,
      防御力: 0,
      攻击间隔: 0,
      攻击速度: 0.1,
      暴击率: 5,
      暴击伤害: 10,
      闪避率: 0,
      格挡率: 0,
      格挡伤害: 0,
      伤害抗性: {},
      抗性穿透: {
        物理: 5,
      },
      生命偷取: 0,
      技能急速: 0,
      幸运值: 0,
      最大魔典数: 0,
    },
  },
};

export { EquipType, equipConfigs };
